/****************************************Copyright (c)**************************************************
**                               广州周立功单片机发展有限公司
**                                     研    究    所
**                                        产品一部 
**
**                                 http://www.zlgmcu.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: PWM.h
**创   建   人: 张斌
**最后修改日期: 2006-5-12
**描        述: LPC2200 PWM操作软件包头文件。
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 张斌
** 版  本: V1.0
** 日　期: 2006-5-12
** 描　述: LPC2200 PWM操作软件包头文件。
**
**------------------------------------------------------------------------------------------------------
** 修改人:
** 版  本:
** 日　期:
** 描　述:
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人: 
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include "config.h"

#define		Read_PWM()	PWMTC		//读取PWM定时器的值
/*********************************************************************************************************
** 函数名称：uint8	SingleEdgePWM_Init(uint32 F_PWM,uint32 PR_Data,uint32 PWMMRn,uint8 PWMn,uint8 INTEn)
** 功能描述：单边沿PWM初始化。
** 入口参数：F_PWM		PWM频率控制寄存器，该值直接写入到PWMMR0寄存器中
**			 PR_Data	预分频器的值
**			 PWMMRn		PWM匹配寄存器，控制PWM边沿的位置
**			 PWMn		PWM通道选择，有效值为1～6
**			 INTEn		中断使能
**						>0	TC值与PWMMR0匹配时产生中断
**						0	TC值与PWMMR0匹配时不产生中断
** 出口参数：0	初始化失败
**           1	初始化成功
** 说明：使用PWMMR0来控制PWM的频率。匹配时，复位PWMTC；
**		 包含有引脚初始化操作。
********************************************************************************************************/
extern  uint8  SingleEdgePWM_Init(uint32 F_PWM,uint32 PR_Data,uint32 PWMMRn,uint8 PWMn,uint8 INTEn);


/*********************************************************************************************************
** 函数名称：uint8	DoubleEdgePWM_Init(uint32 F_PWM,uint32 PR_Data,uint32 SetPWMMRn,
**									   uint32 ClrPWMMRn,uint8 PWMn,uint8 INTEn)
** 功能描述：双边沿PWM初始化。
** 入口参数：F_PWM		PWM频率控制寄存器，该值直接写入到PWMMR0寄存器中
**			 PR_Data	预分频器的值
**			 SetPWMMRn	PWM置位匹配寄存器，控制PWM上升沿的位置
**			 ClrPWMMRn	PWM复位匹配寄存器，控制PWM下降沿的位置
**			 PWMn		PWM通道选择：2、3、4、5、6为有效通道
**			 INTEn		中断使能
**						>0	TC值与PWMMR0匹配时产生中断
**						0	TC值与PWMMR0匹配时不产生中断
** 出口参数：0	初始化失败
**           1	初始化成功
** 说明：使用PWMMR0来控制PWM的频率。匹配时，复位PWMTC；
**		 包含有引脚初始化操作。
********************************************************************************************************/
extern  uint8  DoubleEdgePWM_Init(uint32 F_PWM,uint32 PR_Data,uint32 SetPWMMRn,
						   uint32 ClrPWMMRn,uint8 PWMn,uint8 INTEn);


/*********************************************************************************************************
** 函数名称：void	TimePWM_Init(uint32 PWM_time,uint32 PR_Data,uint8 TMODE)
** 功能描述：PWM初始化为32位定时器
** 入口参数：PWM_time	定时时间,该值会直接写入到PWMMR0寄存器中
**			 PR_Data	预分频器的值
**			 TMODE		工作模式，按位操作
**						bit0--中断，为1时，产生中断
**						bit1--复位，为1时，PWMTC复位
**						bit2--停止，为1时，PWMTC停止
** 出口参数：无
** 说明：PWM使用PWMMR0完成定时器的初始化工作。
********************************************************************************************************/
extern  void  TimePWM_Init(uint32 time,uint32 PR_Data,uint8 TMODE);


