
#include "config.h"
#include "stdlib.h"

#define		TaskStkLengh	128			//定义用户任务LED的堆栈长度
#define	    Boad_LED1		(1 << 22)	//P1.22控制LED1

OS_STK	TaskLEDStk [TaskStkLengh];		//定义用户任务LED的堆栈

void 	TaskLED(void *pdata);			//声明任务LED

/*********************************************************************************************************
** 函数名称：main()
** 函数功能：主函数创建LED任务，初始化及启动操作系统
********************************************************************************************************/
int main (void)
{
	OSInit ();																					
	OSTaskCreate (TaskLED,(void *)0, &TaskLEDStk[TaskStkLengh - 1], 3);		
	OSStart ();
	return 0;															
}
/*********************************************************************************************************
** 任务名称：TaskLED
** 任务功能：LED闪烁
********************************************************************************************************/
void TaskLED(void *pdata)
{
	pdata = pdata;
	TargetInit ();    //硬件初始化
	PINSEL0=0X00;
	IO0DIR|=LED1;     //设置LED为输出
	
	while (1)
	{
        IO0CLR=LED1;                    //点亮LED
		OSTimeDlyHMSM(0,0,0,250);       //延时250ms
		IO0SET=LED1;                    //熄灭LED
		OSTimeDlyHMSM(0,0,0,250);       //延时250ms
	}
}

/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
