/****************************************Copyright (c)**************************************************
**                               广州周立功单片机发展有限公司
**                                     研    究    所
**                                        产品一部 
**
**                                 http://www.zlgmcu.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: GPIO.c
**创   建   人: 
**最后修改日期: 2006-5-12
**描        述: LPC2200 GPIO操作软件包。
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 张斌
** 版  本: V1.0
** 日　期: 2006-5-12
** 描　述: LPC2200 GPIO操作软件包。
**
**------------------------------------------------------------------------------------------------------
** 修改人:
** 版  本:
** 日　期:
** 描　述:
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人: 
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include "config.h"
/*********************************************************************************************************
** 函数名称：void  P0_GPIOInit(uint32  num,uint8  dir)
** 功能描述：将P0口中，num为1的位初始化为GPIO。
** 入口参数：num	需要初始化的管脚
**			 dir	管脚的输入输出方向，1--输出，0--输入
** 出口参数：无
** 说明：	 如果dir错误，则默认为输入模式；
**			 对于LPC2200，缺少P0.26和P0.31。
********************************************************************************************************/
void  P0_GPIOInit(uint32  num,uint8  dir)
{
	uint8	i;
	if((num & 0xffff)!=0)		//初始化引脚P0.0~P0.15，需要设置PINSEL0
		for(i=0;i<16;i++)
			if((num & (1<<i))!=0)
				PINSEL0 = PINSEL0 & (~(0x03<<(2*i)));
	if(num > 0xffff)			//初始化引脚P0.16~P0.31，需要设置PINSEL1
		for(i=16;i<32;i++)	
			if((num & (1<<i))!=0)
				PINSEL1 = PINSEL1 & (~(0x03<<(2*(i-16))));
	if(dir==1)	IO0DIR = (IO0DIR & (~num))|num;
	else		IO0DIR = (IO0DIR & (~num));
}
/*********************************************************************************************************
** 函数名称：void  P1_GPIOInit(uint32  num,uint8  dir)
** 功能描述：将P1口中，num为1的位初始化为GPIO。
** 入口参数：num  	需要初始化的管脚
**			 dir	管脚的输入输出方向，1--输出，0--输入
** 出口参数：无
** 说明：	 如果dir错误，则默认为输入模式；
**		 	 对于LPC2200，只有P1.16～P1.31。
********************************************************************************************************/
void  P1_GPIOInit(uint32  num,uint8  dir)
{	
	if((num & (0x3ff<<16)) != 0)	PINSEL2 = PINSEL2 & (~(1<<3));	//P1.16~P1.25，由PINSEL2.3位控制
	if( num > (0x3ff<<16))			PINSEL2 = PINSEL2 & (~(1<<2));	//P1.26~P1.31，由PINSEL2.2位控制
	if(dir==1)	IO1DIR = (IO1DIR & (~num)) | num;
	else		IO1DIR = (IO1DIR & (~num));
}
/*********************************************************************************************************
** 函数名称：void  P2_GPIOInit(uint32  num,uint8  dir)
** 功能描述：将P2口中，num为1的位初始化为GPIO。
** 入口参数：num	需要初始化的管脚
**			 dir	管脚的输入输出方向，1--输出，0--输入
** 出口参数：无
** 说明：	如果dir错误，则默认为输入模式；
**			如果禁止外部总线，    则P2.0 ～P2.31均可作为GPIO使用；
**			如果使用外部8位总线， 则P2.8 ～P2.31均可作为GPIO使用；
**			如果使用外部16位总线，则P2.16～P2.31均可作为GPIO使用；
**			如果使用外部32位总线，则P2口不可作为GPIO使用。
********************************************************************************************************/
void  P2_GPIOInit(uint32  num,uint8  dir)
{	
	if((num & 0x000000ff) != 0)			//PINSEL2[5:4] = 11b,P2.0~P2.31均可以设置为GPIO
	{
		PINSEL2 |= (0x03 << 4); 
		goto	P2_GPIOInit_Ext;
	}
	if((num & 0x0000ff00) != 0)			//PINSEL2[5:4] = 00b,P2.8~P2.31均可以设置为GPIO
	{
		PINSEL2 &= (~(0x03 << 4));
		goto	P2_GPIOInit_Ext;
	}
	if((num & 0xffff0000) != 0)			//PINSEL2[5:4] = 01b,P2.16~P2.31均可以设置为GPIO
	{
		PINSEL2 = (PINSEL2 & (~(0x03 << 4))) | (0x01 << 4);
		goto	P2_GPIOInit_Ext;
	}
	
P2_GPIOInit_Ext:
	if((num & (0x03 << 28)) != 0)	PINSEL2 &= (~(0x01 << 20));	//PINESL2[20] = 0,P2.28~P2.29设置为GPIO
	if((num & (0x01 << 30)) != 0)	PINSEL2 &= (~(0x01 << 21));	//PINESL2[21] = 0,P2.30设置为GPIO
	if((num & (0x80000000)) != 0)	PINSEL2 &= (~(0x01 << 22));	//PINESL2[22] = 0,P2.31设置为GPIO
	if(dir==1)	IO2DIR = (IO2DIR & (~num)) | num;
	else		IO2DIR = (IO2DIR & (~num));
}
/*********************************************************************************************************
** 函数名称：void  P3_GPIOInit(uint32  num,uint8  dir)
** 功能描述：将P3口中，num为1的位初始化为GPIO。
** 入口参数：num 	需要初始化的管脚
**			 dir	管脚的输入输出方向，1--输出，0--输入
** 出口参数：无
** 说明：	 如果dir错误，则默认为输入模式；
**			 如果将P3.2～P3.23中的任一引脚设置为GPIO，那么该函数会将所有的这些引脚全部初始化为GPIO。
********************************************************************************************************/
void  P3_GPIOInit(uint32  num,uint8  dir)
{	
	if((num & 0x01) != 0)				PINSEL2 &= (~(0x01 << 23));		//PINSEL2[23] = 0,P3.0设置为GPIO
	if((num & (0x01 << 1)) != 0)		PINSEL2 &= (~(0x01 << 24));		//PINSEL2[24] = 0,P3.1设置为GPIO					
	//如果将P3.2～P3.23中的任一引脚设置为GPIO，那么该函数会将所有的这些引脚全部初始化为GPIO。
	if((num & (0x3fffff << 2)) != 0)	PINSEL2 &= (~(0x07 << 25));																		
	if((num & (1 << 23)) != 0)			PINSEL2 &= (~(1 << 13));		//PINSEL2[13]=0,P3.23设置为GPIO
	if((num & (1 << 24)) != 0)			PINSEL2 &= (~(0x03 << 16));		//PINSEL2[17:16]=00,P3.24设置为GPIO		
	if((num & (1 << 25)) != 0)			PINSEL2 &= (~(0x03 << 14));		//PINSEL2[15:14]=00,P3.25设置为GPIO		 	
	if((num & (1 << 26)) != 0)			PINSEL2 &= (~(1 << 11));		//PINSEL2[11]=0,P3.26设置为GPIO		
	if((num & (1 << 27)) != 0)			PINSEL2 &= (~(1 << 8)); 		//PINSEL2[8]=0,P3.27设置为GPIO		
	if((num & (1 << 28)) != 0)			PINSEL2 &= (~(1 << 7)); 		//PINSEL2[7]=0,P3.28设置为GPIO		
	if((num & (1 << 29)) != 0)			PINSEL2 &= (~(1 << 6)); 		//PINSEL2[6]=0,P3.29设置为GPIO		
	if((num & (1 << 30)) != 0)			PINSEL2 &= (~(0x03 << 4));		//PINSEL2[5:4]=00/11,P3.30设置为GPIO			
	if((num & 0x80000000 )!= 0)			PINSEL2 |= (0x03 <<4);			//PINSEL2[5:4]=11,P3.31设置为GPIO
		
	if(dir==1)	IO3DIR = (IO3DIR & (~num)) | num;
	else		IO3DIR = (IO3DIR & (~num));
}
/*********************************************************************************************************
** 函数名称：void  P0_GPIODir(uint32  num,uint8  dir)
** 功能描述：在P0口中，设置num为1的位输入,输出方式。
** 入口参数：num	需要初始化的管脚
**			 dir	管脚的输入输出方向，1--输出，0--输入	
** 出口参数：无
** 说明：如果dir错误，则默认为输入模式。
********************************************************************************************************/
void  P0_GPIODir(uint32  num,uint8  dir)
{	
	if(dir==1)	IO0DIR = (IO0DIR & (~num))|num;		//1	表示该位为输出模式
	else		IO0DIR = (IO0DIR & (~num));			//0	表示该位为输入模式
}
/*********************************************************************************************************
** 函数名称：void  P1_GPIODir(uint32  num,uint8  dir)
** 功能描述：在P1口中，设置num为1的位输入,输出方式。
** 入口参数：num  	需要初始化的管脚
**			 dir	管脚的输入输出方向，1--输出，0--输入	
** 出口参数：无
** 说明：如果dir错误，则默认为输入模式。
********************************************************************************************************/
void  P1_GPIODir(uint32  num,uint8  dir)
{	
	if(dir==1)	IO1DIR = (IO1DIR & (~num))|num;	//1	表示该位为输出模式
	else		IO1DIR = (IO1DIR & (~num));		//0	表示该位为输入模式
}
/*********************************************************************************************************
** 函数名称：void  P2_GPIODir(uint32  num,uint8  dir)
** 功能描述：在P2口中，设置num为1的位输入,输出方式。
** 入口参数：num  	需要初始化的管脚
**			 dir	管脚的输入输出方向，1--输出，0--输入	
** 出口参数：无
** 说明：如果dir错误，则默认为输入模式。
********************************************************************************************************/
void  P2_GPIODir(uint32  num,uint8  dir)
{	
	if(dir==1)	IO2DIR = (IO2DIR & (~num))|num;	//1	表示该位为输出模式
	else		IO2DIR = (IO2DIR & (~num));		//0	表示该位为输入模式
}
/*********************************************************************************************************
** 函数名称：void  P3_GPIODir(uint32  num,uint8  dir)
** 功能描述：在P3口中，设置num为1的位输入,输出方式。
** 入口参数：num  	需要初始化的管脚
**			 dir	管脚的输入输出方向，1--输出，0--输入	
** 出口参数：无
** 说明：如果dir错误，则默认为输入模式。
********************************************************************************************************/
void  P3_GPIODir(uint32  num,uint8  dir)
{	
	if(dir==1)	IO3DIR = (IO3DIR & (~num))|num;	//1	表示该位为输出模式
	else		IO3DIR = (IO3DIR & (~num));		//0	表示该位为输入模式
}
