/****************************************Copyright (c)**************************************************
**                               广州周立功单片机发展有限公司
**                                     研    究    所
**                                        产品一部 
**
**                                 http://www.zlgmcu.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: Time.c
**创   建   人: 张斌
**最后修改日期: 2006-5-12
**描        述: LPC2200定时器0、1操作软件包。
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 张斌
** 版  本: V1.0
** 日　期: 2006-5-12
** 描　述: LPC2200定时器0、1操作软件包。
**
**------------------------------------------------------------------------------------------------------
** 修改人:
** 版  本:
** 日　期:
** 描　述:
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人: 
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include "config.h"

/*********************************************************************************************************
** 函数名称：uint8  T0CAP_Init(uint8 CAP_MODE,uint32 PR_data,uint8 CAPn,uint8 Int_En)
** 功能描述：定时器0捕获模式初始化。
** 入口参数：CAP_MODE	捕获方式，按位操作方式。
**						bit0	1--CAP上跳沿捕获
**						bit1	1--CAP下降沿捕获
**			 PR_data	预分频寄存器的值
**			 CAPn		捕获通道选择，0～3
**			 Int_En		中断使能
**						0:发生捕获事件时，不产生中断
**						1:发生捕获事件时，产生中断
** 出口参数：1 	初始化成功
**         	 0 	初始化失败
** 说明：调用前，要设置相关的引脚。
********************************************************************************************************/
uint8  T0CAP_Init(uint8 CAP_MODE,uint32 PR_data,uint8 CAPn,uint8 Int_En)
{
	if(CAP_MODE > 3)	return(0);	//参数不合理，直接返回
	if(CAPn > 3)		return(0);
	if(Int_En > 1)		return(0);
	T0TCR = 0x03;					//在设置之前，先将定时器复位
	T0PR = PR_data;					//设置预分频寄存器
	T0IR = T0IR | (1<<(CAPn+4));	//清除中断标志位
	//设置捕获控制寄存器，不会影响其它位
	T0CCR = (T0CCR & (~(3<<(CAPn*3)))) | (CAP_MODE<<(CAPn*3)) | (Int_En<<(CAPn*3+2));	
	//           相关位清零                  捕获方式位              中断位
	T0TCR = 0x01;					//启动定时器
	return(1); 	
}
/*********************************************************************************************************
** 函数名称：uint8	T1CAP_Init(uint8 CAP_MODE,uint32 PR_data,uint8 CAPn,uint8 Int_En)
** 功能描述：定时器1捕获模式初始化
** 入口参数：CAP_MODE	捕获方式，按位操作方式。
**						bit0	1--CAP上跳沿捕获
**						bit1	1--CAP下降沿捕获
**			 PR_data		预分频寄存器的值
**			 CAPn		捕获通道选择，0～3
**			 Int_En		中断使能
**						0:发生捕获事件时，不产生中断
**						1:发生捕获事件时，产生中断
** 入口参数：0	初始化失败
**           1 	初始化成功
** 说明：调用前，要设置相关的引脚
********************************************************************************************************/
uint8	T1CAP_Init(uint8 CAP_MODE,uint32 PR_data,uint8 CAPn,uint8 Int_En)
{
	if(CAP_MODE > 3)	return(0);	//参数不合理，直接返回
	if(CAPn > 3)		return(0);
	if(Int_En > 1)		return(0);
	T1TCR = 0x03;					//在设置之前，先将定时器复位
	T1PR = PR_data;					//设置预分频寄存器
	T1IR = T1IR|(1<<(CAPn+4));		//清除中断标志位
	//设置捕获控制寄存器，不会影响其它位
	T1CCR = (T1CCR&(~(3<<(CAPn*3)))) | (CAP_MODE<<(CAPn*3)) | (Int_En<<(CAPn*3+2));	
	//           相关位清零                捕获方式位              中断位
	T1TCR = 0x01;					//启动定时器
	return(1); 
}
/*********************************************************************************************************
** 函数名称：uint8 T0MAT_Init(uint32 time,uint32 PR_data,uint8 T_MODE,uint8 EXT_MODE,uint8 MATn,uint8 Int_En)
** 功能描述：定时器0匹配模式初始化。
** 入口参数：time		匹配时间，该值会直接写入到匹配寄存器中
**			 PR_data	预分频寄存器的值
**			 T_MODE		匹配控制模式
**						0:匹配时，定时器复位
**						1:匹配时，定时器停止
**			 EXT_MODE	匹配时，外部输出控制
**						0:不执行任何动作
**						1:外部匹配输出0
**						2:外部匹配输出1
**						3:外部匹配输出翻转
**			 MATn		匹配通道选择，0～3
**			 Int_En		中断使能
**						0:发生匹配事件时，不产生中断
**						1:发生匹配事件时，产生中断
** 入口参数：0	初始化失败
**           1	初始化成功
** 说明：调用前，要设置相关的引脚
********************************************************************************************************/
uint8  T0MAT_Init(uint32 time,uint32 PR_data,uint8 T_MODE,uint8 EXT_MODE,uint8 MATn,uint8 Int_En)
{
	if(T_MODE > 1)		return(0);		//参数不合理，直接返回
	if(EXT_MODE > 3)	return(0);
	if(MATn > 3)		return(0);
	if(Int_En > 1)		return(0);	
	T0TCR = 0x03;						//在设置之前，先将定时器复位
	T0IR = T0IR|(1<<MATn);				//清除中断标志位
	T0PR = PR_data;						//设置预分频器 
	*(uint32 *)((&T0MR0)+MATn) = time;	//设置匹配寄存器
	T0MCR = T0MCR&(~(7<<(MATn*3)))|(1<<(MATn*3+1+T_MODE))|(Int_En<<(MATn*3));
	//          相关位清零           定时器匹配控制位          中断位
	T0EMR = T0EMR&(~(3<<(MATn*2+4)))|(EXT_MODE<<(MATn*2+4));
	T0TCR = 0x01;						//重新启动定时器
	return(1);
}
/*********************************************************************************************************
** 函数名称：uint8	T1MAT_Init(uint32 time,uint32 PR_data,uint8 T_MODE,uint8 EXT_MODE,uint8 MATn,uint8 Int_En)
** 功能描述：定时器1匹配模式初始化
** 入口参数：time		匹配时间，该值会直接写入到匹配寄存器中
**			 PR_data	预分频寄存器的值
**			 T_MODE		匹配控制模式
**						0:匹配时，定时器复位
**						1:匹配时，定时器停止
**			 EXT_MODE	匹配时，外部输出控制
**						0:不执行任何动作
**						1:外部匹配输出0
**						2:外部匹配输出1
**						3:外部匹配输出翻转
**			 MATn		匹配通道选择，0～3
**			 Int_En		中断使能
**						0:发生匹配事件时，不产生中断
**						1:发生匹配事件时，产生中断
** 入口参数：0 	初始化失败
**           1 	初始化成功
** 说明：调用前，要设置相关的引脚
********************************************************************************************************/
uint8	T1MAT_Init(uint32 time,uint32 PR_data,uint8 T_MODE,uint8 EXT_MODE,uint8 MATn,uint8 Int_En)
{
	if(T_MODE > 1)		return(0);		//参数不合理，直接返回
	if(EXT_MODE > 3)	return(0);
	if(MATn > 3)		return(0);
	if(Int_En > 1)		return(0);	
	T1TCR = 0x03;						//在设置之前，先将定时器复位
	T1IR = T1IR|(1<<MATn);				//清除中断标志位
	T1PR = PR_data;						//设置预分频器
	*(uint32 *)((&T1MR0)+MATn) = time;	//设置匹配寄存器
	T1MCR = T1MCR&(~(7<<(MATn*3)))|(1<<(MATn*3+1+T_MODE))|(Int_En<<(MATn*3));
	//          相关位清零           定时器匹配控制位          中断位
	T1EMR = T1EMR&(~(3<<(MATn*2+4)))|(EXT_MODE<<(MATn*2+4));
	T1TCR = 0x01;						//启动定时器
	return(1);
}

