/****************************************Copyright (c)**************************************************
**                               广州周立功单片机发展有限公司
**                                     研    究    所
**                                        产品一部 
**
**                                 http://www.zlgmcu.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: Time.h
**创   建   人: 张斌
**最后修改日期: 2006-5-12
**描        述: LPC2200定时器0、1操作软件包头文件。
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 张斌
** 版  本: V1.0
** 日　期: 2006-5-12
** 描　述: LPC2200定时器0、1操作软件包头文件。
**
**------------------------------------------------------------------------------------------------------
** 修改人:
** 版  本:
** 日　期:
** 描　述:
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人: 
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include "config.h"

#define		Read_T0()	T0TC		//读取定时器0的计数值
#define		Read_T1()	T1TC		//读取定时器1的计数值
/*********************************************************************************************************
** 函数名称：uint8  T0CAP_Init(uint8 CAP_MODE,uint32 PR_data,uint8 CAPn,uint8 Int_En)
** 功能描述：定时器0捕获模式初始化。
** 入口参数：CAP_MODE	捕获方式，按位操作方式。
**						bit0	1--CAP上跳沿捕获
**						bit1	1--CAP下降沿捕获
**			 PR_data	预分频寄存器的值
**			 CAPn		捕获通道选择，0～3
**			 Int_En		中断使能
**						0:发生捕获事件时，不产生中断
**						1:发生捕获事件时，产生中断
** 出口参数：1 	初始化成功
**         	 0 	初始化失败
** 说明：调用前，要设置相关的引脚。
********************************************************************************************************/
extern  uint8  T0CAP_Init(uint8 CAP_MODE,uint32 PR_data,uint8 CAPn,uint8 Int_En);


/*********************************************************************************************************
** 函数名称：uint8	T1CAP_Init(uint8 CAP_MODE,uint32 PR_data,uint8 CAPn,uint8 Int_En)
** 功能描述：定时器1捕获模式初始化
** 入口参数：CAP_MODE	捕获方式，按位操作方式。
**						bit0	1--CAP上跳沿捕获
**						bit1	1--CAP下降沿捕获
**			 PR_data		预分频寄存器的值
**			 CAPn		捕获通道选择，0～3
**			 Int_En		中断使能
**						0:发生捕获事件时，不产生中断
**						1:发生捕获事件时，产生中断
** 入口参数：0	初始化失败
**           1 	初始化成功
** 说明：调用前，要设置相关的引脚
********************************************************************************************************/
extern  uint8	T1CAP_Init(uint8 CAP_MODE,uint32 PR_data,uint8 CAPn,uint8 Int_En);


/*********************************************************************************************************
** 函数名称：uint8 T0MAT_Init(uint32 time,uint32 PR_data,uint8 T_MODE,uint8 EXT_MODE,uint8 MATn,uint8 Int_En)
** 功能描述：定时器0匹配模式初始化。
** 入口参数：time		匹配时间，该值会直接写入到匹配寄存器中
**			 PR_data	预分频寄存器的值
**			 T_MODE		匹配控制模式
**						0:匹配时，定时器复位
**						1:匹配时，定时器停止
**			 EXT_MODE	匹配时，外部输出控制
**						0:不执行任何动作
**						1:外部匹配输出0
**						2:外部匹配输出1
**						3:外部匹配输出翻转
**			 MATn		匹配通道选择，0～3
**			 Int_En		中断使能
**						0:发生匹配事件时，不产生中断
**						1:发生匹配事件时，产生中断
** 入口参数：0	初始化失败
**           1	初始化成功
** 说明：调用前，要设置相关的引脚
********************************************************************************************************/
extern  uint8  T0MAT_Init(uint32 time,uint32 PR_data,uint8 T_MODE,uint8 EXT_MODE,uint8 MATn,uint8 Int_En);


/*********************************************************************************************************
** 函数名称：uint8	T1MAT_Init(uint32 time,uint32 PR_data,uint8 T_MODE,uint8 EXT_MODE,uint8 MATn,uint8 Int_En)
** 功能描述：定时器1匹配模式初始化
** 入口参数：time		匹配时间，该值会直接写入到匹配寄存器中
**			 PR_data	预分频寄存器的值
**			 T_MODE		匹配控制模式
**						0:匹配时，定时器复位
**						1:匹配时，定时器停止
**			 EXT_MODE	匹配时，外部输出控制
**						0:不执行任何动作
**						1:外部匹配输出0
**						2:外部匹配输出1
**						3:外部匹配输出翻转
**			 MATn		匹配通道选择，0～3
**			 Int_En		中断使能
**						0:发生匹配事件时，不产生中断
**						1:发生匹配事件时，产生中断
** 入口参数：0 	初始化失败
**           1 	初始化成功
** 说明：调用前，要设置相关的引脚
********************************************************************************************************/
extern  uint8	T1MAT_Init(uint32 time,uint32 PR_data,uint8 T_MODE,uint8 EXT_MODE,uint8 MATn,uint8 Int_En);



