/****************************************Copyright (c)**************************************************
**                               广州周立功单片机发展有限公司
**                                     研    究    所
**                                        产品一部 
**
**                                 http://www.zlgmcu.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: ExtInterrupt.c
**创   建   人: 张斌
**最后修改日期: 2006-5-19
**描        述: LPC2200 外部中断应用软件包。
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 张斌
** 版  本: V1.0
** 日　期: 2006-5-19
** 描　述: LPC2200 外部中断应用软件包。
**
**------------------------------------------------------------------------------------------------------
** 修改人:
** 版  本:
** 日　期:
** 描　述:
**
**--------------当前版本修订------------------------------------------------------------------------------
** 修改人: 
** 日　期:
** 描　述:
**
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include "config.h"

/*********************************************************************************************************
** 函数名称：uint8 SetExtInt(uint8 no, uint8 mode, uint8 bWakeUp)
** 函数功能：设置外部中断。
** 入口参数：no			外部中断，取值0～3
**			 mode		中断触发类型，取值如下：
**                      0：低电平触发	1：高电平触发
**                      2：下降沿触发	3：上升沿触发
**			 bWakeUp	是否使能中断唤醒CPU。
**						0	不唤醒CPU
**						>0	使能唤醒CPU
** 出口参数：0	参数错误
**			 1	操作成功
** 说明：需要在外部设置引脚模式。
********************************************************************************************************/
uint8 SetExtInt(uint8 no, uint8 mode, uint8 bWakeUp)
{
	if(no > 3) return 0;		// 返回参数错误
	if(mode>3) return 0;   
    
    EXTINT &= (1 << no);		// 清零EXINT中断标志
    
    if(bWakeUp > 0) 
    {
        bWakeUp = 1;
        EXTWAKE |= (bWakeUp << no);	// 设置唤醒标志
    }
	switch(mode)
	{
		case 0:						// 低电平触发
			EXTMODE  &= ~(1<<no);
			EXTPOLAR &= ~(1<<no);
			break;
		case 1: 					// 高电平触发
			EXTMODE  &= ~(1<<no);
			EXTPOLAR |=  (1<<no);
			break;
		case 2:						// 下降沿触发
			EXTMODE  |=  (1<<no);
			EXTPOLAR &= ~(1<<no);
			break;
		case 3:						// 上升沿触发
			EXTMODE  |=  (1<<no);
			EXTPOLAR |=  (1<<no); 
			break;
		default:
			break;                       
	}
	return 1;
}

